-- 사원 릴레이션
CREATE TABLE 사원 (
    사원번호 INT PRIMARY KEY,
    이름 VARCHAR(20) NOT NULL,
    입사일 DATE NOT NULL,
    호봉 INT NOT DEFAULT 10,
    휴대폰 VARCHAR(13) UNIQUE
);

INSERT INTO 사원 VALUES
(1101, '김정아', '2022-03-01', 20, '010-3452-0022'),
(1102, '이기원', '2022-03-01', 18, '010-1478-1287'),
(1103, '박영종', '2022-09-01', 15, '010-3214-1234'),
(1201, '최강희', '2022-02-01', 21, '010-1122-3344'),
(1202, '조현수', '2022-03-15', 14, '010-5566-4321'),
(1203, '박제성', '2022-09-01', 17, '010-3452-3457'),
(1312, '김민수', '2022-01-15', DEFAULT, '010-2340-0023'),
(1314, '이정숙', '2022-02-10', DEFAULT, '010-3420-0991');

SELECT * FROM 사원;

-- 부서 릴레이션
CREATE TABLE 부서 (
    부서번호 INT PRIMARY KEY,
    부서명 VARCHAR(10) NOT NULL DEFAULT '인사부',
    부서장 INT UNIQUE,
    사무실 VARCHAR(4) NOT NULL UNIQUE,
    전화번호 VARCHAR(13) UNIQUE
);

INSERT INTO 부서 VALUES
(100, '기획실', 1101, 'A402', '02-233-1233'),
(200, '비서실', 1102, 'A502', '02-455-1221'),
(300, '총무부', 1201, 'B311', '041-567-3454'),
(400, DEFAULT, 1203, 'B201', '041-344-6776'),
(500, '자재부', NULL, 'A102', '02-458-45012');

TABLE 부서; -- SELECT * FROM 부서;

-- 금누하다 릴레이션
CREATE TABLE 근무하다 (
    사번 INT REFERENCES 사원(사원번호),
    부서번호 INT REFERENCES 부서(부서번호),
    직책 VARCHAR(20) NOT NULL
);

INSERT INTO 근무하다 VALUES
(1101, 100, '부장'),
(1102, 200, '과장'),
(1103, 200, '대리'),
(1201, 300, '부장'),
(1202, 300, '대리'),
(1203, 400, '과장'),
(1312, 100, '사원'),
(1314, 400, '사원');

SELECT * FROM 근무하다 WHERE 직책 = '사원';